In [1]:
import numpy as np
import pandas as pd

TIEMPO
    • OverTime: Indica si el empleado trabaja horas extras ("Yes" para sí o "No" para no).
    • StandardHours: Las horas estándar de trabajo.
    • TotalWorkingYears: Total de años de experiencia laboral del empleado.
    • TrainingTimesLastYear: Número de veces que el empleado recibió capacitación el año pasado.
    • YearsAtCompany: Años que el empleado ha trabajado en la empresa actual.
    • YearsInCurrentRole: Años que el empleado ha estado en su puesto actual.
    • YearsSinceLastPromotion: Años desde la última promoción del empleado.
    • YearsWithCurrManager: Años que el empleado ha estado bajo la supervisión del actual gerente.
    • AGE

In [2]:
df = pd.read_csv("../notebooks/df_limpio.csv")
df

,Unnamed: 0,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,...,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,remote_work
0,0,51,False,NaN,684.0,NaN,6,3,NaN,162.0,...,3.0,20,NaN,15,15,19537.0,1972,1.000000e+09,NaN,True
1,1,52,False,NaN,699.0,NaN,1,4,Life Sciences,259.0,...,3.0,33,NaN,11,9,19999.0,1971,1.000000e+09,NaN,True
2,2,42,False,rarely,532.0,Research & Development,4,2,Technical Degree,319.0,...,NaN,22,NaN,11,15,19232.0,1981,1.000000e+09,Research & Development,True
3,3,47,False,rarely,359.0,NaN,2,4,Medical,NaN,...,NaN,20,NaN,5,6,17169.0,1976,1.000000e+09,NaN,False
4,4,46,False,NaN,1319.0,NaN,3,3,Technical Degree,NaN,...,3.0,19,NaN,2,8,NaN,1977,1.000000e+09,NaN,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,1609,36,True,rarely,530.0,NaN,3,1,Life Sciences,967.0,...,3.0,16,NaN,3,7,10325.0,1987,1.000000e+09,NaN,False
1610,1610,45,False,no,805.0,NaN,4,2,NaN,972.0,...,2.0,9,NaN,0,8,4447.0,1978,1.000000e+09,NaN,True
1611,1611,39,False,rarely,903.0,NaN,13,5,NaN,NaN,...,3.0,8,NaN,0,7,NaN,1984,1.000000e+09,NaN,True
1612,1612,36,False,no,1229.0,NaN,8,4,Technical Degree,990.0,...,3.0,7,NaN,0,7,NaN,1987,1.000000e+09,NaN,NaN
1613,1613,46,False,NaN,566.0,NaN,7,2,Medical,NaN,...,3.0,8,NaN,0,7,10845.0,1977,1.000000e+09,NaN,False

In [3]:
columnas_time = ['over_time','standard_hours','total_workin_gyears','training_times_last_year','years_at_company','years_in_current_role','years_since_last_promotion','years_with_curr_manager','age']

In [4]:
df[columnas_time]

,over_time,standard_hours,total_workin_gyears,training_times_last_year,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,age
0,False,NaN,NaN,5,20,NaN,15,15,51
1,NaN,NaN,34.0,5,33,NaN,11,9,52
2,False,NaN,22.0,3,22,NaN,11,15,42
3,NaN,NaN,NaN,2,20,NaN,5,6,47
4,False,NaN,NaN,5,19,NaN,2,8,46
...,...,...,...,...,...,...,...,...,...
1609,NaN,NaN,NaN,6,16,NaN,3,7,36
1610,NaN,NaN,NaN,5,9,NaN,0,8,45
1611,False,NaN,9.0,3,8,NaN,0,7,39
1612,False,NaN,12.0,3,7,NaN,0,7,36
1613,NaN,NaN,NaN,3,8,NaN,0,7,46

In [5]:
#el tipo de dato esta bien
df[columnas_time].dtypes

over_time                      object
standard_hours                float64
total_workin_gyears           float64
training_times_last_year        int64
years_at_company                int64
years_in_current_role         float64
years_since_last_promotion      int64
years_with_curr_manager         int64
age                             int64
dtype: object

In [6]:
#analizar la de overtime que es la única no numérica para olvidarnos de ella
df['over_time'].value_counts()

over_time
False    682
True     256
Name: count, dtype: int64

In [7]:
#la paso a bool aunque igual esto ya estaba hecho proque no refleja el cambio
df['over_time'].astype('bool')

0       False
1        True
2       False
3        True
4       False
        ...
1609     True
1610     True
1611    False
1612    False
1613     True
Name: over_time, Length: 1614, dtype: bool

In [8]:
#standard hour y years in current role tienen muchos nulos, miro cuantos :
nulos_standard = (df['years_in_current_role'].isnull().sum()/ df['years_in_current_role'].shape[0])*100
nulos_standard

97.89343246592317

In [9]:
df['years_in_current_role'].value_counts()

years_in_current_role
2.0     11
7.0      5
0.0      4
4.0      3
1.0      3
11.0     2
6.0      2
3.0      2
13.0     1
12.0     1
Name: count, dtype: int64

## volver a correr

In [10]:
#age debe ser 18 años mayor que total working years

In [24]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'business_travel', 'daily_rate',
       'department', 'distance_from_home', 'education', 'education_field',
       'employee_number', 'environment_satisfaction', 'gender', 'hourly_rate',
       'job_involvement', 'job_level', 'job_role', 'job_satisfaction',
       'marital_status', 'monthly_income', 'monthly_rate',
       'num_companies_worked', 'over18', 'over_time', 'percent_salary_hike',
       'performance_rating', 'relationship_satisfaction', 'standard_hours',
       'stock_option_level', 'total_workin_gyears', 'training_times_last_year',
       'work_life_balance', 'years_at_company', 'years_in_current_role',
       'years_since_last_promotion', 'years_with_curr_manager',
       'same_as_monthly_income', 'date_birth', 'salary', 'role_departament',
       'remote_work'],
      dtype='object')

In [26]:
df['age2'] =2023 -df['date_birth']
df['age2']

0       51
1       52
2       42
3       47
4       46
        ..
1609    36
1610    45
1611    39
1612    36
1613    46
Name: age2, Length: 1614, dtype: int64

In [27]:
df_age = df[['age2', 'total_workin_gyears']].T

In [28]:
for columna in df_age:
    if df_age[columna][0] - df_age[columna][1] < 18:
        print('dato erroneo')
        print(f'la edad es :{df_age[columna][0]}')
        print(f'el total workg years es:{df_age[columna][1]}')
    
#un trabajor comenzó a trabajar con 14 años, mirar más datos sobre él para ver si el registro en general está mal

In [29]:
#buscar al trabajador ----- depende del otro
trabajador14años = df.loc[(df['age'] == 32.0) & (df['total_workin_gyears'] == 18.0)]
trabajador14años

,Unnamed: 0,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,...,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,remote_work,age2
1293,1293,32,False,rarely,1305.0,NaN,10,4,NaN,518.0,...,1,NaN,0,1,4197.0,1986,1.000000e+09,NaN,NaN,37

----

In [14]:
#el año de nacimiento tampoco está bien

In [15]:
#total working years debe ser mayor a years at company:
df_years = df[['total_workin_gyears', 'years_at_company']].T
df_years

,0,1,2,3,4,5,6,7,8,9,...,1604,1605,1606,1607,1608,1609,1610,1611,1612,1613
total_workin_gyears,NaN,34.0,22.0,NaN,NaN,NaN,28.0,20.0,22.0,21.0,...,NaN,NaN,NaN,10.0,8.0,NaN,NaN,9.0,12.0,NaN
years_at_company,20.0,33.0,22.0,20.0,19.0,22.0,21.0,20.0,18.0,18.0,...,7.0,7.0,7.0,9.0,8.0,16.0,9.0,8.0,7.0,8.0

In [16]:
for columna in df_years:
    if {df_years[columna][0]} < {df_years[columna][1]}:
        print('dato erroneo')
        print('----------')
        
#todo en orden

In [17]:
#years_at_company debe ser mayor que years_in_current_role
df_role = df[['total_workin_gyears', 'years_in_current_role']].T
df_role

,0,1,2,3,4,5,6,7,8,9,...,1604,1605,1606,1607,1608,1609,1610,1611,1612,1613
total_workin_gyears,NaN,34.0,22.0,NaN,NaN,NaN,28.0,20.0,22.0,21.0,...,NaN,NaN,NaN,10.0,8.0,NaN,NaN,9.0,12.0,NaN
years_in_current_role,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
for columna in df_role:
    if {df_role[columna][0]} < {df_role[columna][1]}:
        print('dato erroneo')
        print('----------')
    
#todo en orden

In [19]:
#years_at_company debe ser mayor que years_since_last_promotion
df_promotion = df[['total_workin_gyears', 'years_since_last_promotion']].T
df_promotion

,0,1,2,3,4,5,6,7,8,9,...,1604,1605,1606,1607,1608,1609,1610,1611,1612,1613
total_workin_gyears,NaN,34.0,22.0,NaN,NaN,NaN,28.0,20.0,22.0,21.0,...,NaN,NaN,NaN,10.0,8.0,NaN,NaN,9.0,12.0,NaN
years_since_last_promotion,15.0,11.0,11.0,5.0,2.0,4.0,7.0,11.0,11.0,0.0,...,1.0,5.0,0.0,8.0,6.0,3.0,0.0,0.0,0.0,0.0

In [20]:
for columna in df_promotion:
    if {df_promotion[columna][0]} < {df_promotion[columna][1]}:
        print('dato erroneo')
        print('----------')
    
#todo en orden

In [21]:
#years_at_company debe ser mayor que years_with_curr_manager
df_manager = df[['total_workin_gyears', 'years_with_curr_manager']].T
df_manager

,0,1,2,3,4,5,6,7,8,9,...,1604,1605,1606,1607,1608,1609,1610,1611,1612,1613
total_workin_gyears,NaN,34.0,22.0,NaN,NaN,NaN,28.0,20.0,22.0,21.0,...,NaN,NaN,NaN,10.0,8.0,NaN,NaN,9.0,12.0,NaN
years_with_curr_manager,15.0,9.0,15.0,6.0,8.0,7.0,9.0,6.0,8.0,11.0,...,0.0,2.0,7.0,5.0,3.0,7.0,8.0,7.0,7.0,7.0

In [22]:
for columna in df_manager:
    if {df_manager[columna][0]} < {df_manager[columna][1]}:
        print('dato erroneo')
        print('----------')
    
#todo en orden

**CAMBIOS REALIZADOS**

COLUMNAS ELIMINADAS:

- 'employeecount': todos tenían el mismo valor (1)
- 'NUMBERCHILDREN': la columna no tenía ningún dato
- 'SameAsMonthlyIncome': era la copia exacta de monthly_income
- 'Salary': todos tenían el mismo valor y además era un valor claramente erróneo ()
- 'Over18': No aporta ningún dato extra que no aporte el año de nacimiento y es un valor que podría variar de un año a otro por lo que requiere mantenimiento
- 'Age': No aporta ningún dato extra que no aporte el año de nacimiento, es un valor que podría variar de un año a otro por lo que requiere mantenimiento lo que puede llevar a errores. De hecho, muchos casos tenía nulos y valores que no concuerdan con el año de nacimiento por lo que hemos decidido quedarnos con date_birth que es más fiable y seguro
- 'StandardHours': tenía un 98% de nulos y además, los datos que tenía eran todos el mismo: 80h
- 'RoleDepartment': los datos de esta columna ya los tenemos por separado en otras dos columnas: JobRole y Departament

DUPLICADOS:

- Hemos eliminado los duplicados exactos (registros totalmente iguales)
- Hemos revisado el resto de duplicados y decidido dejarlos como están

CAMBIOS DE TIPOS DE DATO:

- Hemos convertido en booleanos y cambiado los valores por True y False (para homogenizarlos) en las columnas:
    - 'Attrition', 'RemoteWork', 'OverTime'
- Hemos convertido en float los valores numéricos en las columnas: 
    - 'employeenumber', 'PerformanceRating', 'TOTALWORKINGYEARS', 'YearsInCurrentRole', 'DailyRate', 'WORKLIFEBALANCE', 'MonthlyIncome'
- Hemos homogenizado los valores tipo object poniéndolos en minúscula y quitande espacios antes y después del valor en las columnas:
    - columnas obj
COLUMNAS:

- Hemos renombrado las columnas poniendo _ donde debería haber espacios y quitando mayúsculas

VALORES:

- Hemos cambiado los valores de  'BusinessTravel' para hacerlos más amigables:
    - {"non-travel":"no", "travel_rarely":"rarely", "travel_frequently":"frequently"}
- Hemos visto que hay valores negativos en "DistanceFromHome" y al analizarlo hemos visto que parecía que el único error era el símbolo ya que eran distancias realistas, por lo que hemos convertido todos los valores en positivo.
- Hemos cambiado los valores de Gender para hacerlos más amigables:
    - ({1: "F", 0: 'M'})
- Hemos corregido errores en la escritura de la columna 'MaritalStatus' (en algunos casos estaba escrito 'marreid' en lugar de 'married')
- Hemos cambiado los datos tipo 'Not Available' por nulos
- Hemos pasado los datos de "PercentSalaryHike" a porcentajes como indica su nombre

In [33]:
df_original['Department', 'RoleDepartament']

KeyError: ('Department', 'RoleDepartament')

In [42]:
df_original['Department'].isnull().sum()

1312

In [35]:
df_original = pd.read_csv("../csv-archivos/HR RAW DATA.csv")
df_original.columns

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [45]:
df_original['JobRole']

0             resEArch DIREcToR
1                       ManAGeR
2                       ManaGER
3             ReseArCH DIrECtOr
4               sAleS EXECUtIve
                  ...
1609            saLEs ExeCUTiVe
1610      LAboRaTOry tECHNiCIAn
1611            sAlES ExECUTivE
1612            SaLes ExecUtIVe
1613     mAnUfactURInG DiRECTOr
Name: JobRole, Length: 1614, dtype: object